data_generation/simulation_results/case_73/constant/simParams
nIter 2000;
hComponent0 1536.2038972011603;
hComponent1 4505.609646063673;
hComponent2 2701.317402914236;
hComponent3 742.9602418063009;
hComponent4 2902.2429080462916;kComponent0 58.51034297884959;
kComponent1 73.2530718810146;
kComponent2 59.79869863747994;
kComponent3 24.34719774687281;
kComponent4 67.31365717795332;
tAmbient 300;
Ux 1.0270706925307986;
kPCB 0.702819665177569;